<?php
/**
 * Created by PhpStorm.
 * User: cesc
 * Date: 2020/6/21
 * Time: 4:29 PM
 */

/**
 * 所有枚举
 */
return [
    'photo' => [
        'photo_type' => [
            1 => 'VR看房',
            2 => '实景图',
            3 => '配套图',
            4 => '房型图',
            5 => '其它',
        ]
    ],
    'banner' => [
        'position' => [
            1 => '首页',
            2 => '列表页',
            3 => '资讯列表页',
            4 => '政策列表页',
            5 => '专题列表页'
        ],
        'link_type' => [
            1 => 'H5',
            2 => '养老机构',
            3 => '资讯',
            4 => '专题',
            5 => '政策'
        ],
        'more_city' => [
            [
                'id' => 0,
                'city_name' => '全国'
            ]
        ]
    ],
    'news' => [
        'type' => [
            1 => '资讯',
            2 => '政策',
            3 => '专题'
        ],
        'more_city' => [
            [
                'id' => 0,
                'city_name' => '全国'
            ]
        ]
    ],
    'activity' => [
        'type' => [
            1 => '体验活动'
        ]
    ],
    'estate_hx' => [
        'shi' => [0,1,2,3,4,5,6,7,8,9],
        'ting' => [0,1,2,3,4,5,6,7,8,9],
        'wei' => [0,1,2,3,4,5,6,7,8,9]
    ]
];