<?php
/**
 * 此文件为机构以及机构筛选所用配置
 * Created by PhpStorm.
 * User: cesc
 * Date: 2020/7/17
 * Time: 11:07 AM
 */
return [
    /***这部分为基础数据***/
    'org_type' => ['养老院','养老公寓', '护养院', '康复医院','康复中心','敬老院','福利院','托老所','社区日间照料中心','居家养老服务中心','大型CCRC综合社区'],
    'service_scope' => ['机构内服务','社区服务', '上门服务'],
    'grade' => ['暂无等级','1星', '2星', '3星', '4星', '5星'],
    'nature' => ['公办公营', '公建民营', '公办民营', '民办民营', '社会团体', '其它'],
    'target_person' => ['自理', '半护', '全护', '特护', '专护'],
    'bed_number' => ['50以下', '50-100', '100-150', '150-200', '200以上'],
    'health_insurance' => ['没有','有'],
    'vr' => ["没有","有"],
    'comment' => '<p>入院评估由至少两名评估人员同时开展评估工作，且有一人具有医学或护理学背景，其他评估员应获得社会工作者资格证书，或为养老护理员（取得二级养老护理员及以上职业资格证书）。</p><p>评估内容至少包括老年人日常生活活动能力、精神状态、感知觉与沟通、社会参与进行服务安全风险评估。具体包括噎食、食品药品误食、压疮、烫伤、坠床、跌倒、他伤和自伤、走失、文娱活动意外等9个方面内容。&nbsp;</p><p>&nbsp;根据评估结果和老年人服务需求，制定照护服务计划，包括服务等级、服务项目、膳食要求等。</p>',//入住标准
    'service' => [
        ['name' => '出入院服务','desc' =>'提供入院评估、入院手续办理及出院手续办理服务'],
        ['name' => '生活照料服务','desc' =>'提供老年人个人清洁卫生、饮食照料、起居照料、排泄照料、体位转换及位置转移等服务'],
        ['name' => '健康管理服务','desc' =>'提供健康监测、定期体检、预防保健等服务'],
        ['name' => '营养膳食服务','desc' =>'提供适合老年人的营养膳食，以及各种不同形态的膳食和治疗膳食等服务'],
        ['name' => '清洁卫生服务','desc' =>'提供老年人居室内清洁服务和提供公共区域清洁服务'],
        ['name' => '医疗护理服务','desc' =>'提供药物管理、协助医疗、绿色通道、慢病管理、老年人常见病多发病诊疗服务、24小时照护、术后护理、卧床专护、院内感染控制等服务'],
        ['name' => '康复服务','desc' =>'提供肢体康复服务、康复护理服务、辅助器具适配和使用训练服务、康复咨询服务等'],
        ['name' => '娱乐休闲','desc' =>'组织开展休闲娱乐活动，包括节日及纪念日庆祝活动、老年人生日庆祝等活动'],
        ['name' => '委托服务','desc' =>'提供包括但不限于代管物品、代领物品、代缴各种费用、代购、代办、陪同出行、协助交通等服务'],
        ['name' => '心理/精神支持服务','desc' =>'提供环境适应、情绪疏导、心理支持、危机干预等服务'],
        ['name' => '教育服务','desc' =>'开展老年教育活动或开展老年大学等'],
        ['name' => '居家上门服务','desc' =>'助餐、助浴、助洁、助行、助乐、助购、助聊、助学等'],
        ['name' => '居家上门服务','desc' =>'助急、助医、护理、家属照护指导等'],
        ['name' => '居家上门服务','desc' =>'开设家庭养老床位、心理/精神支持服务等'],
        ['name' => '社区养老服务','desc' =>'提供日托服务；提供法律法规咨询、法律援助；应急救援等服务'],
        ['name' => '安宁服务','desc' =>'提供临终关怀、哀伤辅导等服务。']
    ],
    /***以下为对应界面***/
    'org_page' => [
        'org_type','service_scope','grade','nature','target_person','comment','service'
    ],
    'filter_page' => [
        ['value'  => 'grade', 'option' => '民政评级'],
        ['value'  => 'bed_number', 'option' => '床位数'],
        ['value'  => 'health_insurance', 'option' => '医保'],
        ['value'  => 'nature', 'option' => '机构性质'],
        ['value'  => 'target_person', 'option' => '收住对象'],
        ['value'  => 'service_scope', 'option' => '服务范围'],
        ['value'  => 'vr', 'option' => 'vr'],
    ]
];